// Напишите программу которая считает сумму чисел от 1 до n


using System.ComponentModel.DataAnnotations;

// Console.Clear();

// Console.Write("Введите последнее число до которого считаем сумму: ");
// int last = int.Parse(Console.ReadLine()!);
// int summ = 0;
// int[] Array = new int[last];
// for (int i = 0; i < last; i++)
// {
//     Array[i] = Array[i] + i+1;
//     summ = summ + Array[i];
// }
// Console.WriteLine($"Сумма элементов от 1 до {last}: {summ}");

// Console.Clear();
// Console.Write("Введите последнее число до которого считаем сумму: ");
// int last = int.Parse(Console.ReadLine()!);
// Console.WriteLine($"Сумма элементов от 1 до {last} = {(1+last) / 2.0 * last}");

// который на вход принимает third числа
//  и выводит big
// int firstNumber = int.Parse(Console.ReadLine()!);
// int secondNumber = int.Parse(Console.ReadLine()!);
// int freeNumber = int.Parse(Console.ReadLine()!);
// int maxNumber = 0;
// for (int i = 0;; i++)
// {




// }

