// Задача 2. Напишите программу, которая на вход принимает два числа
// и выдаёт, какое начисло наибольшее, а какое наименьшее

// Console.Write("Введите число a: ");
// int a = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите число b: ");
// int b = Convert.ToInt32(Console.ReadLine());
// if (a > b)
// {
//     Console.WriteLine("Наибольшее число: " + a);
//     Console.WriteLine("Наименьшее число: " + b);
// }
// else if (a < b)
// {
//     Console.WriteLine("Наибольшее число: " + b);
//     Console.WriteLine("Наименьшее число: " + a);
// }
// else if (a == b)
// {
//     Console.WriteLine("Число а = числу b");
// }

// Задача 4. Напишите программу, которая на вход принимает три числа и выдаёт максимальное из этих чисел

// Console.Write("Введите число a: ");
// int a = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите число b: ");
// int b = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите число c: ");
// int c = Convert.ToInt32(Console.ReadLine());
// if (a > b)
// {
//     Console.WriteLine("Наибольшее число:" + a);
// }
// else if (a < c)
// {
//     Console.WriteLine("Наибольшее число:" + c);
// }
// else
// {
//     Console.WriteLine("Наибольшее число:" + b);
// }

// // Задача 6. Напишите программу, которая на вход принимает число и выдаёт, является ли число четным (делится ли оно на 2 без остатка)

// Console.Write("Введите число: ");
// int a = Convert.ToInt32(Console.ReadLine());
// if (a % 2 == 0)
// {
//     Console.WriteLine("Введённое число является четным");
// }
// else
// {
//     Console.WriteLine("Введённое число является нечетным");
// }

// Задача 8. Напишите программу, которая на вход принимает число (N), а на выходе показывает
// все четные числа от 1 до N

// Console.Write("Введите число N: ");
// int N = Convert.ToInt32(Console.ReadLine());
// if (N % 2 == 0)
// {
//    Console.Write(+ N);
// }
// // int negativeN = N / 2; // 5* -1 = -5
// // // N=2
// // while (negativeN <= N)  // negN = -2 -1 0 1 2
// {
//     Console.Write(N + "\t"); // -2
//     // negativeN++; //Инкремент: Увл. negativeN на 1(negativeN)
//     // negativeN += 1;
// }

// Console.Write("Введите число: ");
// int number = Convert.ToInt32(Console.ReadLine());

// int evenNumber = 2;

// if(number > 1)
// {
//     while(evenNumber <= number)
//     {
//         Console.Write(evenNumber + "\t");
//         evenNumber = evenNumber + 2;
//     }
// }

// Console.Write("Введите число: ");
// int a = Convert.ToInt32(Console.ReadLine());

// int b = Convert.ToInt32(5);

// if(a > 1)
// {
//     while(b <= a)
//     {
//       Console.Write(b + "\t");
//        b = b + 5;
//     }
// }